#패턴에서 반복되는 부분을 마디라고 부른다.
# 문자열을 입력 받아 마디의 길이를 출력하는 프로그램을 작성하라.

#################################################################################
#################################################################################
###########################푸는중#################################################
#################################################################################
#################################################################################

import sys
sys.stdin = open('2007 패턴 마디의 길이.txt','r')

T = int(input())
for tc in range(1,T+1):
    line = list(map(str,input()))
    print(line)
    s = ""
    compare = ""
    for li in line:

        if li in s:
            for i in range(len(s)):
                compare += line[len(s) + i]
            if compare == s:  # 반복이 되고 있니?
                print(f"#{tc} {len(s)}")
                break
        s  = s + li
    print(f"#{tc} {len(s)}")

